; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-65)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b19)
    (on b19 b12)
    (on b12 b5)
    (on b5 b11)
    (on b11 b7)
    (on b7 b13)
    (on b13 b1)
    (on b1 b6)
    (on b6 b15)
    (on b15 b2)
    (on-table b2)
    (clear b3)
    (on b3 b8)
    (on b8 b18)
    (on b18 b10)
    (on b10 b4)
    (on b4 b9)
    (on b9 b17)
    (on b17 b14)
    (on-table b14))
 (:goal (and 
(on b14 b11)
))
)

; plan
1. (unstack b3 b8)
   deleted: (on b3 b8) (clear b3) (arm-empty)
   added: (holding b3) (clear b8)
   goals met: 0 of 1
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
3. (unstack b8 b18)
   deleted: (on b8 b18) (clear b8) (arm-empty)
   added: (holding b8) (clear b18)
   goals met: 0 of 1
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
5. (unstack b18 b10)
   deleted: (on b18 b10) (clear b18) (arm-empty)
   added: (holding b18) (clear b10)
   goals met: 0 of 1
6. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
7. (unstack b10 b4)
   deleted: (on b10 b4) (clear b10) (arm-empty)
   added: (holding b10) (clear b4)
   goals met: 0 of 1
8. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
9. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 0 of 1
10. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
11. (unstack b16 b19)
   deleted: (on b16 b19) (clear b16) (arm-empty)
   added: (holding b16) (clear b19)
   goals met: 0 of 1
12. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 1
13. (unstack b19 b12)
   deleted: (on b19 b12) (clear b19) (arm-empty)
   added: (holding b19) (clear b12)
   goals met: 0 of 1
14. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 1
15. (unstack b9 b17)
   deleted: (on b9 b17) (clear b9) (arm-empty)
   added: (holding b9) (clear b17)
   goals met: 0 of 1
16. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
17. (unstack b12 b5)
   deleted: (on b12 b5) (clear b12) (arm-empty)
   added: (holding b12) (clear b5)
   goals met: 0 of 1
18. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 1
19. (unstack b17 b14)
   deleted: (on b17 b14) (clear b17) (arm-empty)
   added: (holding b17) (clear b14)
   goals met: 0 of 1
20. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
21. (unstack b5 b11)
   deleted: (on b5 b11) (clear b5) (arm-empty)
   added: (holding b5) (clear b11)
   goals met: 0 of 1
22. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
23. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 0 of 1
24. (stack b14 b11)
   deleted: (clear b11) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b11)
   goals met: 1 of 1
